spec/fixtures/files/transaction_sample_response_450789469.json

{
  "transactions": [
    {
      "id": 179259969,
      "order_id": 450789469,
      "kind": "sale",
      "gateway": "shopify_payments",
      "status": "success",
      "message": null,
      "created_at": "2005-08-05T12:59:12-04:00",
      "test": false,
      "authorization": "authorization-key",
      "location_id": null,
      "user_id": null,
      "parent_id": 801038806,
      "processed_at": "2005-08-05T12:59:12-04:00",
      "device_id": null,
      "error_code": null,
      "source_name": "web",
      "receipt": {},
      "currency_exchange_adjustment": null,
      "amount": "597",
      "currency": "USD",
      "payment_id": "#1001.3",
      "total_unsettled_set": {
        "presentment_money": {
          "amount": "348.0",
          "currency": "USD"
        },
        "shop_money": {
          "amount": "348.0",
          "currency": "USD"
        }
      },
      "admin_graphql_api_id": "gid://shopify/OrderTransaction/179259969"
    },
    {
      "id": 389404469,
      "order_id": 450789469,
      "kind": "authorization",
      "gateway": "bogus",
      "status": "success",
      "message": null,
      "created_at": "2005-08-01T11:57:11-04:00",
      "test": false,
      "authorization": "authorization-key",
      "location_id": null,
      "user_id": null,
      "parent_id": null,
      "processed_at": "2005-08-01T11:57:11-04:00",
      "device_id": null,
      "error_code": null,
      "source_name": "web",
      "payment_details": {
        "credit_card_bin": null,
        "avs_result_code": null,
        "cvv_result_code": null,
        "credit_card_number": "•••• •••• •••• 4242",
        "credit_card_company": "Visa",
        "buyer_action_info": null,
        "credit_card_name": null,
        "credit_card_wallet": null,
        "credit_card_expiration_month": null,
        "credit_card_expiration_year": null
      },
      "receipt": {
        "testcase": true,
        "authorization": "123456"
      },
      "currency_exchange_adjustment": null,
      "amount": "598.94",
      "currency": "USD",
      "payment_id": "#1001.1",
      "total_unsettled_set": {
        "presentment_money": {
          "amount": "348.0",
          "currency": "USD"
        },
        "shop_money": {
          "amount": "348.0",
          "currency": "USD"
        }
      },
      "admin_graphql_api_id": "gid://shopify/OrderTransaction/389404469"
    },
    {
      "id": 801038806,
      "order_id": 450789469,
      "kind": "capture",
      "gateway": "bogus",
      "status": "success",
      "message": null,
      "created_at": "2005-08-05T10:22:51-04:00",
      "test": false,
      "authorization": "authorization-key",
      "location_id": null,
      "user_id": null,
      "parent_id": 389404469,
      "processed_at": "2005-08-05T10:22:51-04:00",
      "device_id": null,
      "error_code": null,
      "source_name": "web",
      "receipt": {},
      "currency_exchange_adjustment": null,
      "amount": "250.94",
      "currency": "USD",
      "payment_id": "#1001.2",
      "total_unsettled_set": {
        "presentment_money": {
          "amount": "348.0",
          "currency": "USD"
        },
        "shop_money": {
          "amount": "348.0",
          "currency": "USD"
        }
      },
      "admin_graphql_api_id": "gid://shopify/OrderTransaction/801038806"
    }
  ]
}